#### Terraform Plan 📖 `infrastructure/github`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.infisical_secrets.github_folder: Reading...
data.infisical_secrets.aws_folder: Reading...
data.infisical_secrets.infisical_folder: Reading...
data.infisical_secrets.github_folder: Read complete after 0s
data.infisical_secrets.infisical_folder: Read complete after 0s
data.infisical_secrets.aws_folder: Read complete after 0s
github_repository.branch: Refreshing state... [id=branch]
github_actions_secret.infisical_client_id: Refreshing state... [id=branch:INFISICAL_CLIENT_ID]
github_actions_secret.infisical_client_secret: Refreshing state... [id=branch:INFISICAL_CLIENT_SECRET]
github_branch_default.main: Refreshing state... [id=branch]
github_actions_secret.aws_access_key_id: Refreshing state... [id=branch:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=branch:AWS_SECRET_ACCESS_KEY]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOPjZxzc4D-9hQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.github_token will be created
  + resource "github_actions_secret" "github_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "branch"
      + secret_name     = "GH_PAT"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @nourshoreibah, Action: `pull_request`*